content-org/content.org
#+hugo_base_dir: ..
** Installing Code Maat
:PROPERTIES:
:EXPORT_DATE: 2026-01-21T00:00:00-04:00
:EXPORT_FILE_NAME: installing-code-maat
:EXPORT_HUGO_CODE_FENCE: t
:END:
*** Overview

Code Maat is a forensic analysis tool for version control data, created by Adam Tornhill (author of "Your Code as a Crime Scene"). It analyzes git logs to identify hotspots, temporal coupling, code age, and other metrics. These are my notes and install instructions as I got it setup on my local machine.

- Repository: https://github.com/adamtornhill/code-maat
- Book: "Your Code as a Crime Scene" by Adam Tornhill

*** Installation

**** 1. Install Java

Code Maat is a Clojure application packaged as a JAR file, so it requires Java.

#+begin_src bash
brew install openjdk
#+end_src

Add to your shell profile (~/.zshrc or ~/.bashrc):

#+begin_src bash
export PATH="$(brew --prefix)/opt/openjdk/bin:$PATH"
#+end_src

Or create a system-wide symlink:

#+begin_src bash
sudo ln -sfn $(brew --prefix)/opt/openjdk/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk.jdk
#+end_src

Verify installation:

#+begin_src bash
java -version
#+end_src

**** 2. Download Code Maat

#+begin_src bash
mkdir -p ~/tools/code-forensics
cd ~/tools/code-forensics
curl -sL https://github.com/adamtornhill/code-maat/releases/download/v1.0.4/code-maat-1.0.4-standalone.jar -o code-maat.jar
#+end_src

Verify installation:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -h
#+end_src

**** 3. Optional: Create an alias

Add to your shell profile:

#+begin_src bash
alias code-maat="java -jar ~/tools/code-forensics/code-maat.jar"
#+end_src

*** Usage

**** Step 1: Generate Git Log

Code Maat requires a specially formatted git log. Run this in your project directory:

#+begin_src bash
git log --all --numstat --date=short \
  --pretty=format:'--%h--%ad--%aN' \
  --no-renames > gitlog.txt
#+end_src

**** Step 2: Run Analysis

All commands assume you're in the project directory with =gitlog.txt=.

***** Change Frequency (Hotspots)

Find files that change most often:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -l gitlog.txt -c git2 -a revisions
#+end_src

***** Temporal Coupling

Find files that change together:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -l gitlog.txt -c git2 -a coupling
#+end_src

***** Authors / Ownership

Who changed what:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -l gitlog.txt -c git2 -a authors
#+end_src

Primary author per file:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -l gitlog.txt -c git2 -a entity-ownership
#+end_src

***** Code Age

When files were last changed:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -l gitlog.txt -c git2 -a age
#+end_src

***** Code Churn

Lines added/removed per file:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -l gitlog.txt -c git2 -a abs-churn
#+end_src

***** Summary

Repository overview:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -l gitlog.txt -c git2 -a summary
#+end_src

*** Available Analyses

| Analysis           | Description                      |
|--------------------+----------------------------------|
| revisions          | Change frequency per file        |
| coupling           | Temporal coupling between files  |
| authors            | Who changed what                 |
| entity-ownership   | Primary author per file          |
| entity-effort      | Effort distribution              |
| age                | Code age                         |
| abs-churn          | Lines added/removed              |
| author-churn       | Churn per author                 |
| communication      | Communication patterns           |
| summary            | Repository overview              |

*** Output & Visualization

Code Maat outputs CSV to stdout. Save to a file:

#+begin_src bash
java -jar ~/tools/code-forensics/code-maat.jar -l gitlog.txt -c git2 -a revisions > revisions.csv
#+end_src

Tornhill provides D3.js visualization templates at:
https://github.com/adamtornhill/code-maat#visualization

*** Quick Analysis Script

One-liner to generate log and run all common analyses:

#+begin_src bash
#!/bin/bash
# Run from your project directory

MAAT="java -jar ~/tools/code-forensics/code-maat.jar"
OUTDIR="code-forensics-output"

mkdir -p $OUTDIR

# Generate git log
git log --all --numstat --date=short \
  --pretty=format:'--%h--%ad--%aN' \
  --no-renames > $OUTDIR/gitlog.txt

# Run analyses
$MAAT -l $OUTDIR/gitlog.txt -c git2 -a revisions > $OUTDIR/revisions.csv
$MAAT -l $OUTDIR/gitlog.txt -c git2 -a coupling > $OUTDIR/coupling.csv
$MAAT -l $OUTDIR/gitlog.txt -c git2 -a authors > $OUTDIR/authors.csv
$MAAT -l $OUTDIR/gitlog.txt -c git2 -a age > $OUTDIR/age.csv
$MAAT -l $OUTDIR/gitlog.txt -c git2 -a abs-churn > $OUTDIR/churn.csv
$MAAT -l $OUTDIR/gitlog.txt -c git2 -a summary > $OUTDIR/summary.csv

echo "Results saved to $OUTDIR/"
#+end_src

*** Uninstall

To remove Code Maat:

#+begin_src bash
rm -rf ~/tools/code-forensics
#+end_src

To remove Java (if no longer needed):

#+begin_src bash
brew uninstall openjdk
#+end_src

